<a href="https://colab.research.google.com/github/Prithivi1515/Demo/blob/main/SQL_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1. Create a table called employees with the following structure:

In [ ]:
CREATE TABLE employees (
    emp_id INT NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INT CHECK (age >= 18),
    email TEXT UNIQUE,
    salary DECIMAL(10, 2) DEFAULT 30000
);

2. Purpose of constraints and how they help maintain data integrity:

Constraints are rules applied to columns in a table to ensure the accuracy and reliability of the data. They help maintain data integrity by preventing invalid data from being entered into the database. Examples of common constraints include:

Primary Key: Ensures uniqueness and identifies each row uniquely.

Foreign Key: Ensures referential integrity by linking two tables.

NOT NULL: Ensures a column cannot have NULL values.

UNIQUE: Ensures all values in a column are unique.

CHECK: Ensures values in a column satisfy a specific condition.

DEFAULT: Provides a default value for a column if no value is specified.

3. Why apply the NOT NULL constraint? Can a primary key contain NULL values?

The NOT NULL constraint ensures that a column cannot have NULL values, which is useful for mandatory fields like emp_name or emp_id.

A primary key cannot contain NULL values because it uniquely identifies each row in a table. If NULL values were allowed, it would violate the uniqueness constraint.

4. Steps to add or remove constraints on an existing table:

Adding a constraint:

ALTER TABLE employees
ADD CONSTRAINT chk_age CHECK (age >= 18);

Removing a constraint:

ALTER TABLE employees
DROP CONSTRAINT chk_age;

5. Consequences of violating constraints:

When you attempt to insert, update, or delete data in a way that violates constraints, the database will reject the operation and return an error. For example:

Error Message: ERROR: duplicate key value violates unique constraint "employees_email_key"

6. Modify the products table to add constraints:

ALTER TABLE products
ADD PRIMARY KEY (product_id);

ALTER TABLE products
ALTER COLUMN price SET DEFAULT 50.00;

7. Fetch student_name and class_name using INNER JOIN:

SELECT s.student_name, c.class_name
FROM Students s
INNER JOIN Classes c ON s.class_id = c.class_id;

8. Query to show all order_id, customer_name, and product_name:

SELECT o.order_id, c.customer_name, p.product_name

FROM Orders o

INNER JOIN Customers c ON o.customer_id = c.customer_id

LEFT JOIN Products p ON o.order_id = p.order_id;

9. Query to find the total sales amount for each product:

SELECT p.product_name, SUM(s.amount) AS total_sales

FROM Sales s

INNER JOIN Products p ON s.product_id = p.product_id

GROUP BY p.product_name;

10. Query to display order_id, customer_name, and quantity of products ordered:

SELECT o.order_id, c.customer_name, COUNT(p.product_id) AS quantity_ordered

FROM Orders o

INNER JOIN Customers c ON o.customer_id = c.customer_id

INNER JOIN Products p ON o.order_id = p.order_id

GROUP BY o.order_id, c.customer_name;

SQL Commands

1. Primary keys and foreign keys in Maven Movies DB:

Primary Key: Uniquely identifies a row in a table (e.g., actor_id in the actor table).

Foreign Key: Links two tables by referencing the primary key of another table (e.g., film_id in the film_actor table references film_id in the film table).

2. List all details of actors:

SELECT * FROM actor;

3. List all customer information:

SELECT * FROM customer;

4. List different countries:

SELECT DISTINCT country FROM country;

5. Display all active customers:

SELECT * FROM customer WHERE active = 1;

6. List all rental IDs for customer with ID 1:

SELECT rental_id FROM rental WHERE customer_id = 1;

7. Display films with rental duration greater than 5:

SELECT * FROM film WHERE rental_duration > 5;

8. Total number of films with replacement cost between
15 and 20:

SELECT COUNT(*) FROM film WHERE replacement_cost BETWEEN 15 AND 20;

9. Count of unique first names of actors:

SELECT COUNT(DISTINCT first_name) FROM actor;

10. Display the first 10 records from the customer table:

SELECT * FROM customer LIMIT 10;

11. Display the first 3 records from the customer table where first name starts with 'b':

SELECT * FROM customer WHERE first_name LIKE 'b%' LIMIT 3;

12. Names of the first 5 movies rated 'G':

SELECT title FROM film WHERE rating = 'G' LIMIT 5;

13. Find all customers whose first name starts with "a":

SELECT * FROM customer WHERE first_name LIKE 'a%';

14. Find all customers whose first name ends with "a":

SELECT * FROM customer WHERE first_name LIKE '%a';

15. List of first 4 cities that start and end with 'a':

SELECT city FROM city WHERE city LIKE 'a%a' LIMIT 4;

16. Find all customers whose first name has "NI" in any position:

SELECT * FROM customer WHERE first_name LIKE '%NI%';

17. Find all customers whose first name has "r" in the second position:

SELECT * FROM customer WHERE first_name LIKE '_r%';

18. Find all customers whose first name starts with "a" and is at least 5 characters long:

SELECT * FROM customer WHERE first_name LIKE 'a____%';

19. Find all customers whose first name starts with "a" and ends with "o":

SELECT * FROM customer WHERE first_name LIKE 'a%o';

20. Get films with PG and PG-13 ratings:

SELECT * FROM film WHERE rating IN ('PG', 'PG-13');

21. Get films with length between 50 and 100:

SELECT * FROM film WHERE length BETWEEN 50 AND 100;

22. Get the top 50 actors:

SELECT * FROM actor LIMIT 50;

23. Get distinct film IDs from the inventory table:

SELECT DISTINCT film_id FROM inventory;

Functions

1. Total number of rentals:

SELECT COUNT(*) FROM rental;

2. Average rental duration:

SELECT AVG(rental_duration) FROM film;

3. Display customer names in uppercase:

SELECT UPPER(first_name), UPPER(last_name) FROM customer;

4. Extract month from rental date:

SELECT rental_id, MONTH(rental_date) AS rental_month FROM rental;

5. Count of rentals for each customer:

SELECT customer_id, COUNT(*) AS rental_count FROM rental GROUP BY customer_id;

6. Total revenue generated by each store:

SELECT store_id, SUM(amount) AS total_revenue FROM payment GROUP BY store_id;

7. Total number of rentals for each category:

SELECT fc.category_id, COUNT(*) AS rental_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film_category fc ON i.film_id = fc.film_id
GROUP BY fc.category_id;

8. Average rental rate for each language:

SELECT l.name, AVG(f.rental_rate) AS avg_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name;

9. Display movie title, customer's first name, and last name:

SELECT f.title, c.first_name, c.last_name
FROM rental r
JOIN customer c ON r.customer_id = c.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id;

10. Retrieve actors who appeared in "Gone with the Wind":

SELECT a.first_name, a.last_name
FROM film_actor fa
JOIN actor a ON fa.actor_id = a.actor_id
JOIN film f ON fa.film_id = f.film_id
WHERE f.title = 'Gone with the Wind';

11. Retrieve customer names and total amount spent:

SELECT c.first_name, c.last_name, SUM(p.amount) AS total_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id;

12. List titles of movies rented by customers in 'London':

SELECT f.title
FROM rental r
JOIN customer c ON r.customer_id = c.customer_id
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London';

13. Top 5 rented movies:

SELECT f.title, COUNT(*) AS rental_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
GROUP BY f.title
ORDER BY rental_count DESC
LIMIT 5;

14. Customers who rented from both stores:

SELECT c.customer_id, c.first_name, c.last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN customer c ON r.customer_id = c.customer_id
WHERE i.store_id IN (1, 2)
GROUP BY c.customer_id
HAVING COUNT(DISTINCT i.store_id) = 2;

Window Functions

1. Rank customers based on total spending:

SELECT customer_id, first_name, last_name,
       SUM(amount) AS total_spent,
       RANK() OVER (ORDER BY SUM(amount) DESC) AS rank
FROM payment
JOIN customer USING (customer_id)
GROUP BY customer_id;

2. Cumulative revenue per film:

SELECT film_id, title,
       SUM(amount) OVER (ORDER BY rental_date) AS cumulative_revenue
FROM payment
JOIN rental USING (rental_id)
JOIN inventory USING (inventory_id)
JOIN film USING (film_id);

3. Average rental duration for films with similar lengths:

SELECT film_id, title, length,
       AVG(rental_duration) OVER (PARTITION BY length) AS avg_rental_duration
FROM film;

4. Top 3 films in each category based on rental counts:

WITH ranked_films AS (
    SELECT fc.category_id, f.film_id, f.title,
           COUNT(*) AS rental_count,
           RANK() OVER (PARTITION BY fc.category_id ORDER BY COUNT(*) DESC) AS rank
    FROM rental r
    JOIN inventory i ON r.inventory_id = i.inventory_id
    JOIN film f ON i.film_id = f.film_id
    JOIN film_category fc ON f.film_id = fc.film_id
    GROUP BY fc.category_id, f.film_id
)
SELECT category_id, film_id, title, rental_count
FROM ranked_films
WHERE rank <= 3;

Normalization & CTE

1. First Normal Form (1NF):

Example: The film_actor table is already in 1NF because each column contains atomic values.

2. Second Normal Form (2NF):

Example: The film_actor table is in 2NF because it has a composite primary key (film_id, actor_id), and all non-key attributes depend on the entire key.

3. Third Normal Form (3NF):

Example: The film table is in 3NF because there are no transitive dependencies.

4. Normalization Process:

Example: Normalize the customer table by separating address details into a separate address table.

5. CTE to retrieve actor names and number of films:

WITH actor_films AS (
    SELECT a.actor_id, a.first_name, a.last_name, COUNT(fa.film_id) AS film_count
    FROM actor a
    JOIN film_actor fa ON a.actor_id = fa.actor_id
    GROUP BY a.actor_id
)
SELECT * FROM actor_films;

6. CTE to combine film and language information:

WITH film_language AS (
    SELECT f.title, l.name AS language_name, f.rental_rate
    FROM film f
    JOIN language l ON f.language_id = l.language_id
)
SELECT * FROM film_language;

7. CTE to find total revenue per customer:

WITH customer_revenue AS (
    SELECT c.customer_id, c.first_name, c.last_name, SUM(p.amount) AS total_revenue
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id
)
SELECT * FROM customer_revenue;

8. CTE with window function to rank films by rental duration:

WITH ranked_films AS (
    SELECT film_id, title, rental_duration,
           RANK() OVER (ORDER BY rental_duration DESC) AS rank
    FROM film
)
SELECT * FROM ranked_films;

9. CTE to list customers with more than two rentals:

WITH frequent_customers AS (
    SELECT customer_id, COUNT(*) AS rental_count
    FROM rental
    GROUP BY customer_id
    HAVING COUNT(*) > 2
)
SELECT c.*
FROM customer c
JOIN frequent_customers fc ON c.customer_id = fc.customer_id;

10. CTE to find total rentals per month:

WITH monthly_rentals AS (
    SELECT MONTH(rental_date) AS rental_month, COUNT(*) AS rental_count
    FROM rental
    GROUP BY MONTH(rental_date)
)
SELECT * FROM monthly_rentals;

11. CTE to find pairs of actors in the same film:

WITH actor_pairs AS (
    SELECT fa1.actor_id AS actor1, fa2.actor_id AS actor2
    FROM film_actor fa1
    JOIN film_actor fa2 ON fa1.film_id = fa2.film_id
    WHERE fa1.actor_id < fa2.actor_id
)
SELECT * FROM actor_pairs;

12. CTE for recursive search of employees reporting to a manager:

WITH RECURSIVE employee_hierarchy AS (
    SELECT staff_id, first_name, last_name, reports_to
    FROM staff
    WHERE reports_to IS NULL
    UNION ALL
    SELECT s.staff_id, s.first_name, s.last_name, s.reports_to
    FROM staff s
    JOIN employee_hierarchy eh ON s.reports_to = eh.staff_id
)
SELECT * FROM employee_hierarchy;